In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
"EmpID": [1, 2, 3],
"Name": ["Alice", "Bob", "Charlie"],
"DeptID": [10, 20, 30]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [4]:
departments = pd.DataFrame({
"DeptID": [10, 20, 40],
"DeptName": ["HR", "Engineering", "Marketing"]
})

In [5]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [7]:
pd.merge(employees,departments,on="DeptID")#inner join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [9]:
pd.merge(employees,departments,on="DeptID",how="left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [10]:
pd.merge(employees,departments,on="DeptID",how="right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [11]:
pd.merge(employees,departments,on="DeptID",how = "inner")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [12]:
pd.merge(employees,departments,on="DeptID",how = "outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [21]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"ID": [1, 2]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"],"Score": [90, 80]})

In [22]:
pd.concat([df1,df2])

      Name   ID  Score
0    Alice  1.0    NaN
1      Bob  2.0    NaN
0  Charlie  NaN   90.0
1    David  NaN   80.0

In [23]:
pd.concat([df1 ,df2],axis = 1)

    Name  ID     Name  Score
0  Alice   1  Charlie     90
1    Bob   2    David     80